print("**********运算符**********")
-- >Lua中只有加减乘除和取余运算

print("**********运算符_加减乘除取余**********")
-- lua中数值样式的字符串可以直接参与运算,lua会自动转成number类型
print("11" + 1)

-- lua中的除法,如果不能整除,会得到小数,不会对结果进行向下取整,C#会进行向下取整
-- 结果会取小数 6.5
print("13" / 2)

-- 取余
print("13" % 2)

-- 幂运算
print("幂运算" .. 2 ^ 2) -- 2的2次方

print("**********条件运算符**********")
-- 分别是 > < >= <= == ~=
-- >注意:不等号是~=

-- 逻辑与 和逻辑或
-- 逻辑与是and 逻辑或是or

print(true and false) -- false
print(true and true)  -- true
print(true or false)  -- false

-- >逻辑非是not
print(not true) -- false

print("**********位运算符**********")
print("**********三目运算符**********")
--Lua中不支持三目运算符
--Lua中不支持位运算
--需要我们自己去实现
